const path = require ('path')

module.exports = {

////////////////////////////////////////////////////////////////////////////////

get_xsd_path_of_b_r_a_k_r_a_s_t_i_n_f:

    function () {

		return path.join (__dirname, '..', 'Static/zags-brakrastinf-ru-root.xsd')

    },

////////////////////////////////////////////////////////////////////////////////

get_request_of_b_r_a_k_r_a_s_t_i_n_f:

    function () {

		return this.rq.data
    	
    },

////////////////////////////////////////////////////////////////////////////////

get_response_of_b_r_a_k_r_a_s_t_i_n_f:

    function () {
/*    
    	const {rq: {data}} = this
*/
    	return {
  "BRAKRASTINFResponse": {
    "ИдЗапрос": "0bde2079-eded-11ea-952d-00155d01aa22",
    "КолДок": "1",
    "ДатаСвед": "2020-09-10",
    "ТипАГСЗапрос": "03",
    "schemaLocation": "urn://x-artefacts-zags-brakrastinf/root/112-55/4.0.0 zags-brakrastinf-ru-root.xsd",
    "СведОтветАГС": {
      "ИдДок": "0bde2079-eded-11ea-952d-00155d01aa21",
      "РезОбраб": "1",
      "СведРегРастБрак": {
        "РазделЕГР": "1",
        "НомерЗаписЕГР": "130109060000401234123",
        "НомАГССвид": "245679",
        "НомерВерс": "0",
        "ДатаВерс": "2020-01-20",
        "КодСостСтат": "0101",
        "ДатаЗапис": "2020-01-20",
        "ОрганЗАГС": {
          "НаимЗАГС": "Отдел Государственной службы записи актов гражданского состояния Республики Ингушетия Джейрахского района",
          "КодЗАГС": "R0600004"
        },
        "СвидетРастБрак": {
          "ТипСвидет": "1",
          "СерияСвидет": "I-МЮ",
          "НомерСвидет": "1245687",
          "ДатаВыдСвидет": "2020-01-25"
        },
        "ПрдСведРег": {
          "Супруг": {
            "ФамилияДо": "Петров",
            "ФамилияПосле": "Петров",
            "Имя": "Иван",
            "Отчество": "Петрович",
            "ГраждОКСМ": "643",
            "ДатаРождКаленд": "1998-05-08",
            "ПрМестоРожден": "1",
            "ПрАдрМЖ": "1",
            "УдЛичнФЛ": {
              "КодВидДок": "21",
              "СерДок": "2134",
              "НомДок": "123564",
              "ДатаДокКаленд": "2012-06-12",
              "ВыдДок": "Отдел УФМС России по Тюменской области в Центральном административном округе города Тюмени",
              "ПрКодВыдДок": "1"
            }
          },
          "Супруга": {
            "ФамилияДо": "Петрова",
            "ФамилияПосле": "Иванова",
            "Имя": "Лариса",
            "Отчество": "Сергеевна",
            "ПрГражданство": "1",
            "ПрДатаРожд": "1",
            "МестоРожден": {
              "ПризнМесто": "1",
              "МестоТекст": "Российская Федерация, Тюменская область, г. Тюмень",
              "КодСтраны": "643",
              "НаимСтраны": "Российская Федерация",
              "Регион": "72",
              "НаимСубъект": "Тюменская область",
              "Город": "г. Тюмень",
              "ОКТМО": "71701000"
            },
            "АдрМЖ": {
              "АдрМЖРФ": {
                "АдрРФФИАС": {
                  "АдрТекст": "Российская Федерация, Тюменская область, г. Тюмень, ул. Николая Федорова, д.17, кв.309",
                  "ИдНом": "6ce4f31e-2f77-427a-8a50-5c2175ba0cc0",
                  "ОКТМО": "71701000",
                  "Индекс": "000000",
                  "КодРегион": "72",
                  "НаимРегион": "Тюменская область",
                  "Город": "Тюмень",
                  "Улица": "ул Николая Федорова",
                  "Дом": "17",
                  "Кварт": "309"
                }
              }
            },
            "УдЛичнФЛ": {
              "КодВидДок": "21",
              "СерДок": "2134",
              "НомДок": "123564",
              "ДатаДокКаленд": "2007-04-12",
              "ВыдДок": "Отдел УФМС России по Тюменской области в Центральном административном округе города Тюмени",
              "ПрКодВыдДок": "1"
            }
          },
          "ДатаПрекрБрак": "2020-01-25",
          "ПрСведДокЗаклБрак": "1"
        }
      }
    }
  }
}}

}